MahdiThesis-SNOWPACK-meteoio/new-run-SNOWPACKFoam/BYL-tundra-2014-2015-noHet/system/controlDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      controlDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //
application     SNOWPACKFoam;

startFrom       latestTime;

startTime       0;

stopAt          endTime;

endTime         5e9;

deltaT          5;//900;//10;

writeControl    adjustableRunTime;//timeStep;adjustableRunTime;

writeInterval   10800;//10;//10800;

purgeWrite      0; // last two tme steps

writeFormat     ascii; //ascii;binary;

writePrecision  7;

writeCompression off;

timeFormat      general;

timePrecision   6;

runTimeModifiable true;

adjustTimeStep  yes;

maxCo           5;

maxDeltaT 	250;//10;//900;

//libs ("ldarcyGradPressureNew.so");
// ************************************************************************* //
/*
functions
{
    probes
    {
		interpolationScheme cellPoint;
        type			probes;
        functionObjectLibs	("libsampling.so");
        enabled			true;
        writeControl		timeStep;//timeStep;adjustableRunTime;
        writeInterval		5;
		//after			100;

        fields
        (
            gradTm
        );

        probeLocations
        (
            ( 0.5 0.05 0.0 )
            ( 0.5 0.05 1.0 )
        );

    }
}
*/

// ************************************************************************* //
